espressif/esp-idf/components/soc/esp32c3/register/soc/gpio_reg.h
#define GPIO_FUNC124_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x344)
/* GPIO_SIG124_IN_SEL : R/W ;bitpos:[6] ;default: 1'h0 ; */
/*description: */
#define GPIO_SIG124_IN_SEL  (BIT(6))
#define GPIO_SIG124_IN_SEL_M  (BIT(6))
#define GPIO_SIG124_IN_SEL_V  0x1
#define GPIO_SIG124_IN_SEL_S  6
/* GPIO_FUNC124_IN_INV_SEL : R/W ;bitpos:[5] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC124_IN_INV_SEL  (BIT(5))
#define GPIO_FUNC124_IN_INV_SEL_M  (BIT(5))
#define GPIO_FUNC124_IN_INV_SEL_V  0x1
#define GPIO_FUNC124_IN_INV_SEL_S  5
/* GPIO_FUNC124_IN_SEL : R/W ;bitpos:[4:0] ;default: 5'h0 ; */
/*description: */
#define GPIO_FUNC124_IN_SEL  0x0000001F
#define GPIO_FUNC124_IN_SEL_M  ((GPIO_FUNC124_IN_SEL_V)<<(GPIO_FUNC124_IN_SEL_S))
#define GPIO_FUNC124_IN_SEL_V  0x1F
#define GPIO_FUNC124_IN_SEL_S  0

#define GPIO_FUNC125_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x348)
/* GPIO_SIG125_IN_SEL : R/W ;bitpos:[6] ;default: 1'h0 ; */
/*description: */
#define GPIO_SIG125_IN_SEL  (BIT(6))
#define GPIO_SIG125_IN_SEL_M  (BIT(6))
#define GPIO_SIG125_IN_SEL_V  0x1
#define GPIO_SIG125_IN_SEL_S  6
/* GPIO_FUNC125_IN_INV_SEL : R/W ;bitpos:[5] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC125_IN_INV_SEL  (BIT(5))
#define GPIO_FUNC125_IN_INV_SEL_M  (BIT(5))
#define GPIO_FUNC125_IN_INV_SEL_V  0x1
#define GPIO_FUNC125_IN_INV_SEL_S  5
/* GPIO_FUNC125_IN_SEL : R/W ;bitpos:[4:0] ;default: 5'h0 ; */
/*description: */
#define GPIO_FUNC125_IN_SEL  0x0000001F
#define GPIO_FUNC125_IN_SEL_M  ((GPIO_FUNC125_IN_SEL_V)<<(GPIO_FUNC125_IN_SEL_S))
#define GPIO_FUNC125_IN_SEL_V  0x1F
#define GPIO_FUNC125_IN_SEL_S  0

#define GPIO_FUNC126_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x34C)
/* GPIO_SIG126_IN_SEL : R/W ;bitpos:[6] ;default: 1'h0 ; */
/*description: */
#define GPIO_SIG126_IN_SEL  (BIT(6))
#define GPIO_SIG126_IN_SEL_M  (BIT(6))
#define GPIO_SIG126_IN_SEL_V  0x1
#define GPIO_SIG126_IN_SEL_S  6
/* GPIO_FUNC126_IN_INV_SEL : R/W ;bitpos:[5] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC126_IN_INV_SEL  (BIT(5))
#define GPIO_FUNC126_IN_INV_SEL_M  (BIT(5))
#define GPIO_FUNC126_IN_INV_SEL_V  0x1
#define GPIO_FUNC126_IN_INV_SEL_S  5
/* GPIO_FUNC126_IN_SEL : R/W ;bitpos:[4:0] ;default: 5'h0 ; */
/*description: */
#define GPIO_FUNC126_IN_SEL  0x0000001F
#define GPIO_FUNC126_IN_SEL_M  ((GPIO_FUNC126_IN_SEL_V)<<(GPIO_FUNC126_IN_SEL_S))
#define GPIO_FUNC126_IN_SEL_V  0x1F
#define GPIO_FUNC126_IN_SEL_S  0

#define GPIO_FUNC127_IN_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x350)
/* GPIO_SIG127_IN_SEL : R/W ;bitpos:[6] ;default: 1'h0 ; */
/*description: */
#define GPIO_SIG127_IN_SEL  (BIT(6))
#define GPIO_SIG127_IN_SEL_M  (BIT(6))
#define GPIO_SIG127_IN_SEL_V  0x1
#define GPIO_SIG127_IN_SEL_S  6
/* GPIO_FUNC127_IN_INV_SEL : R/W ;bitpos:[5] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC127_IN_INV_SEL  (BIT(5))
#define GPIO_FUNC127_IN_INV_SEL_M  (BIT(5))
#define GPIO_FUNC127_IN_INV_SEL_V  0x1
#define GPIO_FUNC127_IN_INV_SEL_S  5
/* GPIO_FUNC127_IN_SEL : R/W ;bitpos:[4:0] ;default: 5'h0 ; */
/*description: */
#define GPIO_FUNC127_IN_SEL  0x0000001F
#define GPIO_FUNC127_IN_SEL_M  ((GPIO_FUNC127_IN_SEL_V)<<(GPIO_FUNC127_IN_SEL_S))
#define GPIO_FUNC127_IN_SEL_V  0x1F
#define GPIO_FUNC127_IN_SEL_S  0

#define GPIO_FUNC0_OUT_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x554)
/* GPIO_FUNC0_OEN_INV_SEL : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC0_OEN_INV_SEL  (BIT(10))
#define GPIO_FUNC0_OEN_INV_SEL_M  (BIT(10))
#define GPIO_FUNC0_OEN_INV_SEL_V  0x1
#define GPIO_FUNC0_OEN_INV_SEL_S  10
/* GPIO_FUNC0_OEN_SEL : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC0_OEN_SEL  (BIT(9))
#define GPIO_FUNC0_OEN_SEL_M  (BIT(9))
#define GPIO_FUNC0_OEN_SEL_V  0x1
#define GPIO_FUNC0_OEN_SEL_S  9
/* GPIO_FUNC0_OUT_INV_SEL : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC0_OUT_INV_SEL  (BIT(8))
#define GPIO_FUNC0_OUT_INV_SEL_M  (BIT(8))
#define GPIO_FUNC0_OUT_INV_SEL_V  0x1
#define GPIO_FUNC0_OUT_INV_SEL_S  8
/* GPIO_FUNC0_OUT_SEL : R/W ;bitpos:[7:0] ;default: 8'h80 ; */
/*description: */
#define GPIO_FUNC0_OUT_SEL  0x000000FF
#define GPIO_FUNC0_OUT_SEL_M  ((GPIO_FUNC0_OUT_SEL_V)<<(GPIO_FUNC0_OUT_SEL_S))
#define GPIO_FUNC0_OUT_SEL_V  0xFF
#define GPIO_FUNC0_OUT_SEL_S  0

#define GPIO_FUNC1_OUT_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x558)
/* GPIO_FUNC1_OEN_INV_SEL : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC1_OEN_INV_SEL  (BIT(10))
#define GPIO_FUNC1_OEN_INV_SEL_M  (BIT(10))
#define GPIO_FUNC1_OEN_INV_SEL_V  0x1
#define GPIO_FUNC1_OEN_INV_SEL_S  10
/* GPIO_FUNC1_OEN_SEL : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC1_OEN_SEL  (BIT(9))
#define GPIO_FUNC1_OEN_SEL_M  (BIT(9))
#define GPIO_FUNC1_OEN_SEL_V  0x1
#define GPIO_FUNC1_OEN_SEL_S  9
/* GPIO_FUNC1_OUT_INV_SEL : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC1_OUT_INV_SEL  (BIT(8))
#define GPIO_FUNC1_OUT_INV_SEL_M  (BIT(8))
#define GPIO_FUNC1_OUT_INV_SEL_V  0x1
#define GPIO_FUNC1_OUT_INV_SEL_S  8
/* GPIO_FUNC1_OUT_SEL : R/W ;bitpos:[7:0] ;default: 8'h80 ; */
/*description: */
#define GPIO_FUNC1_OUT_SEL  0x000000FF
#define GPIO_FUNC1_OUT_SEL_M  ((GPIO_FUNC1_OUT_SEL_V)<<(GPIO_FUNC1_OUT_SEL_S))
#define GPIO_FUNC1_OUT_SEL_V  0xFF
#define GPIO_FUNC1_OUT_SEL_S  0

#define GPIO_FUNC2_OUT_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x55C)
/* GPIO_FUNC2_OEN_INV_SEL : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC2_OEN_INV_SEL  (BIT(10))
#define GPIO_FUNC2_OEN_INV_SEL_M  (BIT(10))
#define GPIO_FUNC2_OEN_INV_SEL_V  0x1
#define GPIO_FUNC2_OEN_INV_SEL_S  10
/* GPIO_FUNC2_OEN_SEL : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC2_OEN_SEL  (BIT(9))
#define GPIO_FUNC2_OEN_SEL_M  (BIT(9))
#define GPIO_FUNC2_OEN_SEL_V  0x1
#define GPIO_FUNC2_OEN_SEL_S  9
/* GPIO_FUNC2_OUT_INV_SEL : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC2_OUT_INV_SEL  (BIT(8))
#define GPIO_FUNC2_OUT_INV_SEL_M  (BIT(8))
#define GPIO_FUNC2_OUT_INV_SEL_V  0x1
#define GPIO_FUNC2_OUT_INV_SEL_S  8
/* GPIO_FUNC2_OUT_SEL : R/W ;bitpos:[7:0] ;default: 8'h80 ; */
/*description: */
#define GPIO_FUNC2_OUT_SEL  0x000000FF
#define GPIO_FUNC2_OUT_SEL_M  ((GPIO_FUNC2_OUT_SEL_V)<<(GPIO_FUNC2_OUT_SEL_S))
#define GPIO_FUNC2_OUT_SEL_V  0xFF
#define GPIO_FUNC2_OUT_SEL_S  0

#define GPIO_FUNC3_OUT_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x560)
/* GPIO_FUNC3_OEN_INV_SEL : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC3_OEN_INV_SEL  (BIT(10))
#define GPIO_FUNC3_OEN_INV_SEL_M  (BIT(10))
#define GPIO_FUNC3_OEN_INV_SEL_V  0x1
#define GPIO_FUNC3_OEN_INV_SEL_S  10
/* GPIO_FUNC3_OEN_SEL : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC3_OEN_SEL  (BIT(9))
#define GPIO_FUNC3_OEN_SEL_M  (BIT(9))
#define GPIO_FUNC3_OEN_SEL_V  0x1
#define GPIO_FUNC3_OEN_SEL_S  9
/* GPIO_FUNC3_OUT_INV_SEL : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC3_OUT_INV_SEL  (BIT(8))
#define GPIO_FUNC3_OUT_INV_SEL_M  (BIT(8))
#define GPIO_FUNC3_OUT_INV_SEL_V  0x1
#define GPIO_FUNC3_OUT_INV_SEL_S  8
/* GPIO_FUNC3_OUT_SEL : R/W ;bitpos:[7:0] ;default: 8'h80 ; */
/*description: */
#define GPIO_FUNC3_OUT_SEL  0x000000FF
#define GPIO_FUNC3_OUT_SEL_M  ((GPIO_FUNC3_OUT_SEL_V)<<(GPIO_FUNC3_OUT_SEL_S))
#define GPIO_FUNC3_OUT_SEL_V  0xFF
#define GPIO_FUNC3_OUT_SEL_S  0

#define GPIO_FUNC4_OUT_SEL_CFG_REG          (DR_REG_GPIO_BASE + 0x564)
/* GPIO_FUNC4_OEN_INV_SEL : R/W ;bitpos:[10] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC4_OEN_INV_SEL  (BIT(10))
#define GPIO_FUNC4_OEN_INV_SEL_M  (BIT(10))
#define GPIO_FUNC4_OEN_INV_SEL_V  0x1
#define GPIO_FUNC4_OEN_INV_SEL_S  10
/* GPIO_FUNC4_OEN_SEL : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC4_OEN_SEL  (BIT(9))
#define GPIO_FUNC4_OEN_SEL_M  (BIT(9))
#define GPIO_FUNC4_OEN_SEL_V  0x1
#define GPIO_FUNC4_OEN_SEL_S  9
/* GPIO_FUNC4_OUT_INV_SEL : R/W ;bitpos:[8] ;default: 1'h0 ; */
/*description: */
#define GPIO_FUNC4_OUT_INV_SEL  (BIT(8))
#define GPIO_FUNC4_OUT_INV_SEL_M  (BIT(8))
#define GPIO_FUNC4_OUT_INV_SEL_V  0x1
#define GPIO_FUNC4_OUT_INV_SEL_S  8
/* GPIO_FUNC4_OUT_SEL : R/W ;bitpos:[7:0] ;default: 8'h80 ; */
/*description: */
#define GPIO_FUNC4_OUT_SEL  0x000000FF
#define GPIO_FUNC4_OUT_SEL_M  ((GPIO_FUNC4_OUT_SEL_V)<<(GPIO_FUNC4_OUT_SEL_S))
#define GPIO_FUNC4_OUT_SEL_V  0xFF
#define GPIO_FUNC4_OUT_SEL_S  0

